In [1]:
import mysql.connector
from mysql.connector import Error
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
import csv

In [2]:
#Connection to a MYSQL Database

In [3]:
try:
    connection = mysql.connector.connect(host='127.0.0.1',
                                         database='Siddharth',
                                         user='root',
                                         password='password')
    if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL Server version ", db_Info)
        cursor = connection.cursor()
        cursor.execute("select database();")
        record = cursor.fetchone()
        print("You're connected to database: ", record)
except Error as e:
    print("Error while connecting to MySQL", e)

Connected to MySQL Server version  8.0.26
You're connected to database:  ('siddharth',)

In [4]:
cur = connection.cursor(buffered=True)

In [5]:
#Getting names of all the tables in titan.db

In [6]:
cur.execute("SELECT table_name FROM information_schema.tables where table_schema = 'siddharth'")
cur.fetchall()

[('airport',),
 ('author',),
 ('bank_details',),
 ('insurance',),
 ('persons',),
 ('persons_1',),
 ('retail',),
 ('tt',)]

In [7]:
pd.read_sql_query("SELECT table_name FROM information_schema.tables where table_schema = 'siddharth'",connection)

     TABLE_NAME
0       airport
1        author
2  bank_details
3     insurance
4       persons
5     persons_1
6        retail
7            tt

In [8]:
#Creating New Table in SQL Server

In [9]:
cur.execute('CREATE TABLE BANK_DETAILS_1 (ID INT NOT NULL, FIRST_NAME VARCHAR(20), LAST_NAME VARCHAR(20), MOBILE VARCHAR(10))')

In [10]:
#Checking if the table is created

In [11]:
pd.read_sql_query("SELECT table_name FROM information_schema.tables where table_schema = 'siddharth'",connection)

       TABLE_NAME
0         airport
1          author
2    bank_details
3  bank_details_1
4       insurance
5         persons
6       persons_1
7          retail
8              tt

In [12]:
cur.execute("INSERT INTO BANK_DETAILS_1 VALUES (2,'SIDDHARTH','SINGH','7303055634')")

In [13]:
#READING TABLE FROM SQL DATABASE

In [14]:
pd.read_sql_query("SELECT * FROM BANK_DETAILS_1",connection)

   ID FIRST_NAME LAST_NAME      MOBILE
0   2  SIDDHARTH     SINGH  7303055634

In [15]:
cur.execute('SELECT * FROM BANK_DETAILS_1')
cur.fetchall()

[(2, 'SIDDHARTH', 'SINGH', '7303055634')]

In [16]:
connection.close()